
## Plan Result




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user.null_resource.setup_sdp_user[&#34;bspayment&#34;]
  * module.sdp_db_user.random_password.sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.null_resource.setup_sdp_user["bspayment"] will be created
  + resource "null_resource" "setup_sdp_user" {
      + id       = (known after apply)
      + triggers = {
          + "database"        = "bspayment"
          + "fqdn"            = "ccpay-bulkscanning-api-postgres-db-v15-aat.postgres.database.azure.com"
          + "name"            = "ccpay-bulkscanning-api-postgres-db-v15-aat"
          + "schemas"         = "bspayment"
          + "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          + "sdp_reader_pass" = (sensitive value)
          + "sdp_reader_user" = "SDP_READ_USER"
        }
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be created
  + resource "random_password" "sdp_read_user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":518,"Program":"tfcmt","SHA1":"","Vars":{}} -->